import { FC } from "react";
import Layout from "../components/layout";
import Page from "../components/page";

const RulesRemotely: FC = () => {
  return (
    <Layout>
      <Page>
        <p className="text-center fw-bold">
          Правила торговли лекарственными препаратами дистанционным способом.
        </p>
        <p>
          Правительство РФ вынесло Постановление № 697 от 16 мая 2020 года,
          которым утвердило Правила выдачи разрешения на осуществление розничной
          торговли лекарственными препаратами для медицинского применения
          дистанционным способом, осуществления такой торговли и доставки
          указанных лекарственных препаратов гражданам (далее Правила). Отныне
          лекарственные средства для медицинского применения могут продаваться
          дистанционно, в соответствии с регламентом, установленным указанными
          Правилами и иными нормативными актами.
        </p>

        <p className="fw-bold">
          Какие лекарственные средства не могут продаваться дистанционно?
        </p>
        <p>- лекарственные препараты, отпускаемые по рецепту врача;</p>
        <p>- наркотические лекарственные препараты;</p>
        <p>- психотропные лекарственные препараты;</p>
        <p>
          - спиртосодержащие лекарственные препараты с объёмной долей этилового
          спирта свыше 25 %;
        </p>

        <p className="fw-bold">
          Как осуществляются расчёты за лекарственные средства, приобретённые
          дистанционно?
        </p>
        <p>
          Расчёты могут по выбору Покупателя осуществляться в наличной или
          безналичной форме, на условиях предварительной оплаты или с оплатой
          после вручения лекарственных средств, приобретённых дистанционным
          способом.
        </p>

        <p className="fw-bold">
          Кто вправе торговать дистанционно лекарственными средствами?
        </p>
        <p>
          Для розничной торговли лекарственными средствами дистанционным
          способом требуется разрешение, которое выдаётся Федеральной службой по
          надзору в сфере здравоохранения. Для получения разрешения аптечная
          организация обращается с соответствующим заявлением.
        </p>

        <p className="fw-bold">
          Аптечная организация обязана обеспечить конфиденциальность
          персональных данных покупателя в соответствии с требованиями
          законодательства Российской Федерации
        </p>

        <p className="fw-bold">
          Обязанности аптечной организации при приёме заказа (сотрудника
          аптечной организации, который принимает заказ) дистанционным способом:
        </p>

        <p>
          а) <span className="fw-bold">проинформировать покупателя</span> о
          показаниях к применению приобретаемого им лекарственного препарата,
          его розничной цене, сроке годности, условиях отпуска, правилах
          хранения, взаимодействии с другими лекарственными препаратами;
        </p>
        <p>
          б){" "}
          <span className="fw-bold">
            заключить с покупателем в установленном порядке договор розничной
            купли-продажи
          </span>{" "}
          с условием доставки, в котором указываются срок формирования и
          стоимость заказа, стоимость услуги по доставке заказа, возможность его
          получения по месту нахождения аптечной организации или доставки по
          месту жительства (пребывания, фактического нахождения) покупателя,
          иному адресу, согласованному с покупателем, 6 способ и место оплаты
          приобретаемого им лекарственного препарата (далее - договор
          купли-продажи);
        </p>
        <p>
          в){" "}
          <span className="fw-bold">
            согласовать с покупателем необходимость представления документов,
          </span>{" "}
          подтверждающих качество лекарственных препаратов, при их доставке вне
          места нахождения аптечной организации
        </p>

        <p>
          <span className="fw-bold">
            Когда договор розничной купли-продажи лекарственных средств при
            продаже дистанционным способом является заключённым?
          </span>{" "}
          Договор считается заключённым при наступлении любого, наиболее
          раннего, из следующих событий:
        </p>
        <p className="fst-italic">
          момент выдачи аптечной организацией покупателю кассового или товарного
          чека либо иного документа, подтверждающего оплату товара;
        </p>
        <p className="fst-italic">
          момента получения аптечной организацией сообщения о намерении
          покупателя приобрести лекарственные препараты. При оплате
          лекарственного препарата покупателем в безналичной форме (за
          исключением оплаты с использованием банковской карты) продавец обязан
          подтвердить передачу товара путем составления накладной или акта
          сдачи-приемки товара.
        </p>

        <p>
          Доставка заказа в соответствии с условиями заключенного с покупателем
          договора купли-продажи осуществляется работником аптечной организации
          или другой (сторонней) организации на основании договора, в котором
          указываются обязанности каждой из сторон договора, порядок действий и
          ответственность сторон договора.
        </p>

        <p>
          При доставке заказов, содержащих термолабильные лекарственные
          препараты, аптечная организация или доставщик обязаны использовать
          транспортные средства, обеспечивающие поддержание необходимого
          температурного режима, либо применять при доставке соответствующее
          оборудование (изотермическая упаковка, термоконтейнер и т.п.).
        </p>

        <p>
          Кому и где передаётся заказ (лекарственные средства приобретённые
          дистанционным способом)? Заказ передаётся по месту жительства
          покупателя, или по иному адресу, указанному Покупателем при
          формировании заказа. Заказ передаётся лично покупателю, а при
          отсутствии покупателя лицу, предъявившему оригиналы или копии (можно в
          электронном виде) квитанции или иного документа, которые подтверждают
          заключение договора купли-продажи, оплату заказа или оформление его
          доставки.
        </p>

        <p className="fw-bold">
          Обязанности Покупателя при приёмке заказа (лекарственных средств,
          приобретённых дистанционным способом):
        </p>
        <p>- проверить целостность транспортной упаковки,</p>
        <p>- самостоятельно вскрыть транспортную упаковку,</p>
        <p>- сверить содержимое заказа с описью вложения,</p>
        <p>
          - проверить отсутствие повреждений вторичной (потребительской) и
          первичной упаковок лекарственного препарата, надлежащий вид
          лекарственного препарата (при возможности),
        </p>
        <p>
          - расписаться в получении заказа и в подтверждение отсутствия
          претензий к аптечной организации и службе доставки.
        </p>

        <p className="fw-bold">
          Вправе ли Покупатель отказаться от доставленного товара и на каких
          условиях?
        </p>
        <p>
          Да вправе, Покупатель может отказаться от доставленного лекарственного
          препарата надлежащего качества до оплаты заказа. В этом случае
          оплачивается только услуга по доставке.
        </p>

        <p className="fw-bold">
          Права Покупателя в случае доставки некачественного лекарственного
          препарата.
        </p>
        <p>
          "В случае доставки заказа ненадлежащего качества (ненадлежащее
          качество лекарственного препарата, доставленный заказ не соответствует
          заказанному по количеству или составу) покупатель вправе вернуть его
          работнику, осуществляющему доставку, без оплаты доставленного
          лекарственного препарата и (или) услуги по его доставке и (или)
          потребовать надлежащее исполнение заказа" (пункт 26 Правил)
        </p>

        <p className="fw-bold">
          Что будет, если заказ доставлен аптечной организацией, но не принят
          Покупателем по его вине?
        </p>
        <p>
          В случае если доставка заказа произведена в установленные договором
          купли-продажи сроки, но заказ не был передан покупателю по его вине,
          последующая доставка производится в новые сроки, которые должны быть
          согласованы с покупателем, на условиях, предусмотренных договором
          купли-продажи.
        </p>

        <p className="text-center fw-bold">
          Контроль за розничной продажей лекарственных препаратов дистанционным
          способом осуществляет:
        </p>
        <p className="text-center fw-bold">
          ТЕРРИТОРИАЛЬНЫЙ ОРГАН РОСЗДРАВНАДЗОРА ПО РЕСПУБЛИКЕ ДАГЕСТАН
        </p>

        <p>Телефон: +7(8722) 63-71-57, факс: +7(8722) 56-11-15</p>

        <p>E-mail: info@reg5.roszdravnadzor.ru</p>

        <p>
          Адрес: 367027, Республика Дагестан, г. Махачкала, ул. Буганова, 17-б
        </p>
      </Page>
    </Layout>
  );
};

export default RulesRemotely;
