<?php

namespace Database\Seeders;

use App\Models\PickupLocation;
use Illuminate\Database\Seeder;

class PickupLocationsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            ['city' => 'Махачкала',      'slug_id' => 8074, 'lat' => 42.970145,   'lon' => 47.505913,   'address' => 'ул. М.Ярагского, 80'],
            ['city' => 'Махачкала',      'slug_id' => 8068, 'lat' => 42.961780,   'lon' => 47.502688,   'address' => 'пр. Им. Шамиля, 45'],
            ['city' => 'Махачкала',      'slug_id' => 8014, 'lat' => 43.058603,   'lon' => 47.334487,   'address' => 'ул. М.Гаджиева, 7'],
            ['city' => 'Махачкала',      'slug_id' => 8024, 'lat' => 42.953928,   'lon' => 47.505311,   'address' => 'пр. Гамидова, 48'],
            ['city' => 'Махачкала',      'slug_id' => 8027, 'lat' => 42.984491,   'lon' => 47.495474,   'address' => 'ул. Радищева, 3'],
            ['city' => 'Махачкала',      'slug_id' => 8019, 'lat' => 42.966853,   'lon' => 47.503685,   'address' => 'ул. М.Ярагского, 71'],
            ['city' => 'Махачкала',      'slug_id' => 8015, 'lat' => 42.951625,   'lon' => 47.522585,   'address' => 'пр. Им.Шамиля, 101'],
            ['city' => 'Махачкала',      'slug_id' => 8016, 'lat' => 42.970033,   'lon' => 47.486419,   'address' => 'ул. Ш. Алиева, 7 (Шамсулы Алиева, 33 А)'],
            ['city' => 'Махачкала',      'slug_id' => 8009, 'lat' => 43.008935,   'lon' => 47.447423,   'address' => 'ул. Каммаева, 19 в'],
            ['city' => 'Махачкала',      'slug_id' => 8010, 'lat' => 43.008388,   'lon' => 47.448726,   'address' => 'ул. Каммаева, 89 А (Каммаева, 15Б/1)'],
            ['city' => 'Каспийск',       'slug_id' => 8020, 'lat' => 42.878282,   'lon' => 47.643157,   'address' => 'ул. Абдулманапова, 6Б'],
            ['city' => 'Махачкала',      'slug_id' => 8029, 'lat' => 42.985447,   'lon' => 47.467402,   'address' => 'ул. Магомедтагирова,176Г (Магомедтагирова 176Е)'],
            ['city' => 'с.Бабаюрт',      'slug_id' => 8026, 'lat' => 43.601155,   'lon' => 46.779211,   'address' => 'ул. Дж.Алиева, 30'],
            ['city' => 'Махачкала',      'slug_id' => 8012, 'lat' => 42.995287,   'lon' => 47.467330,   'address' => 'ул. М.Гаджиева, 194'],
            ['city' => 'Каспийск',       'slug_id' => 8004, 'lat' => 42.907734,   'lon' => 47.610405,   'address' => 'ул. Каспийская, 6 А'],
            ['city' => 'Махачкала',      'slug_id' => 8032, 'lat' => 42.982750,   'lon' => 47.464051,   'address' => 'ул. Радужная, 4'],
            ['city' => 'Махачкала',      'slug_id' => 8017, 'lat' => 42.953532,   'lon' => 47.508365,   'address' => 'ул. О.Кошевого, 37'],
            ['city' => 'Махачкала',      'slug_id' => 8022, 'lat' => 42.970508,   'lon' => 47.415794,   'address' => 'ул. Айвазовского, 4А/2 (пр. А.Акушинского, 361)'],
            ['city' => 'Махачкала',      'slug_id' => 8005, 'lat' => 42.958896,   'lon' => 47.553640,   'address' => 'пр. Петра I ,135 (Петра 1, 59 Р)'],
            ['city' => 'Махачкала',      'slug_id' => 8006, 'lat' => 42.962175,   'lon' => 47.549786,   'address' => 'ул. Габитова, 2 (пр. Насрутдинова, 49 А)'],
            ['city' => 'Махачкала',      'slug_id' => 8011, 'lat' => 43.003318,   'lon' => 47.456155,   'address' => 'ул. Каммаева, 4Б (Каммаева, 14)'],
            ['city' => 'с.Ботлих',       'slug_id' => 8067, 'lat' => 43.208954,   'lon' => 46.871468,   'address' => 'ул. Им.Газимагомеда, 48'],
            ['city' => 'Махачкала',      'slug_id' => 8023, 'lat' => 42.974696,   'lon' => 47.409047,   'address' => 'п. Семендер, пр. Казбекова, 32'],
            ['city' => 'Хасавюрт',       'slug_id' => 8025, 'lat' => 43.248426,   'lon' => 46.581600,   'address' => 'ул, Даибова, 8'],
            ['city' => 'Махачкала',      'slug_id' => 8035, 'lat' => 42.975679,   'lon' => 47.492222,   'address' => 'ул. Абдулы Алиева, 4А (Абдулы Алиева, 18)'],
            ['city' => 'Махачкала',      'slug_id' => 8036, 'lat' => 42.949018,   'lon' => 47.504439,   'address' => 'пр. Амет-Хана Султана, 6/4 (Ахмет-хана Султана, 4/7)'],
            ['city' => 'Махачкала',      'slug_id' => 8000, 'lat' => 42.966503,   'lon' => 47.511707,   'address' => 'ул. Юсупова, 55'],
            ['city' => 'Каспийск',       'slug_id' => 8001, 'lat' => 42.893290,   'lon' => 47.635575,   'address' => 'ул. Ленина,13'],
            ['city' => 'Махачкала',      'slug_id' => 8003, 'lat' => 42.975119,   'lon' => 47.520420,   'address' => 'пр. Р.Гамзатова, 119'],
            ['city' => 'Избербаш',       'slug_id' => 8018, 'lat' => 42.568362,   'lon' => 47.866191,   'address' => 'ул. Маяковского, 114а'],
            ['city' => 'Махачкала',      'slug_id' => 8062, 'lat' => 42.985678,   'lon' => 47.479718,   'address' => 'ул. Гайдара Гаджиева,14ж/3'],
            ['city' => 'Махачкала',      'slug_id' => 8061, 'lat' => 42.982710,   'lon' => 47.470160,   'address' => 'пр. А.Акушинского, 1А (Им.Шамиля, 4 в)'],
            ['city' => 'Махачкала',      'slug_id' => 8065, 'lat' => 42.959246,   'lon' => 47.511087,   'address' => 'пр. Гамидова, 57'],
            ['city' => 'Каспийск',       'slug_id' => 8039, 'lat' => 42.891467,   'lon' => 47.627634,   'address' => 'ул. Азиза Алиева, 2а'],
            ['city' => 'с. Новокаякент', 'slug_id' => 8058, 'lat' => 42.388296,   'lon' => 47.979001,   'address' => 'ул. У.Джабраиловой, д.  (ул. Новая, 32)'],
            ['city' => 'Махачкала',      'slug_id' => 8063, 'lat' => 42.976570,   'lon' => 47.478020,   'address' => 'пр. Им.Шамиля, 32а'],
            ['city' => 'Махачкала',      'slug_id' => 8064, 'lat' => 42.965138,   'lon' => 47.490596,   'address' => 'ул. Азиза Алиева, 9А'],
            ['city' => 'Махачкала',      'slug_id' => 8054, 'lat' => 42.955472,   'lon' => 47.555086,   'address' => 'пр. Насрутдинова, 30к (пр. Петра I, 44е)'],
            ['city' => 'Махачкала',      'slug_id' => 8057, 'lat' => 42.939918,   'lon' => 47.532000,   'address' => 'ул. Талгинская, 19'],
            ['city' => 'Каспийск',       'slug_id' => 8059, 'lat' => 42.887266,   'lon' => 47.635629,   'address' => 'ул. Сулеймана Стальского, 1'],
            ['city' => 'Махачкала',      'slug_id' => 8069, 'lat' => 42.969175,   'lon' => 47.518085,   'address' => 'пр. Гамидова, 12'],
            ['city' => 'Махачкала',      'slug_id' => 8076, 'lat' => 43.042106,   'lon' => 47.454682,   'address' => 'мкр. Караман-7, Федеральное шоссе, 56'],
            ['city' => 'Махачкала',      'slug_id' => 8070, 'lat' => 42.981306,   'lon' => 47.460350,   'address' => 'пр. А.Акушинского, 34'],
            ['city' => 'Махачкала',      'slug_id' => 8071, 'lat' => 42.968199,   'lon' => 47.539492,   'address' => 'пр. Петра 1, 25 Б (Петра 1, 73А)'],
            ['city' => 'Махачкала',      'slug_id' => 8073, 'lat' => 42.973608,   'lon' => 47.482053,   'address' => 'ул. Ташкентская, 28Б'],
            ['city' => 'Махачкала',      'slug_id' => 8075, 'lat' => 42.952100,   'lon' => 47.506586,   'address' => 'ул. Юсупа Акаева, 23'],
            ['city' => 'Махачкала',      'slug_id' => 8078, 'lat' => 42.966688,   'lon' => 47.496426,   'address' => 'пр. Им.Шамиля,  35 А'],
            ['city' => 'Каспийск',       'slug_id' => 8079, 'lat' => 42.896117,   'lon' => 47.630230,   'address' => 'ул. Ленина,54'],
            ['city' => 'Каспийск',       'slug_id' => 8080, 'lat' => 42.895800,   'lon' => 47.630653,   'address' => 'ул. Ленина зд. 52 Ж (ДФ+)'],
            ['city' => 'Махачкала',      'slug_id' => 8081, 'lat' => 42.948781,   'lon' => 47.504745,   'address' => 'пр. Амет-Хана Султана, 6К (ДФ+)'],
            ['city' => 'Махачкала',      'slug_id' => 8082, 'lat' => 42.971075,   'lon' => 47.417563,   'address' => 'ул. Айвазовского, 2И (ДФ+)'],
            ['city' => 'Махачкала',      'slug_id' => 8083, 'lat' => 42.971477,   'lon' => 47.481577,   'address' => 'ул. Абдулхакима Исмаилова, 32 (ДФ+)'],
            ['city' => 'Махачкала',      'slug_id' => 8084, 'lat' => 42.958896,   'lon' => 47.553640,   'address' => 'пр. Петра I ,135 (ДФ+)'],
            ['city' => 'Махачкала',      'slug_id' => 8086, 'lat' => 42.966206,   'lon' => 47.361706,   'address' => 'пгт. Ленинкент, ул. Алиева, д. 38 (ДФ+)'],

        ];
        foreach ($data as $key => $item) {
            PickupLocation::firstOrCreate(['slug_id' => $item['slug_id']], 
                [
                    'slug_id' => $item['slug_id'],
                    'title' => $item['address'],
                    'address' => $item['address'],
                    'city' => $item['city'],
                    'time' => 'Каждый день с 10 до 20',
                    'subway' => null,
                    'mall' => null,
                    'lat' => $item['lat'],
                    'lon' => $item['lon'],
                    'price' => 0,
                    'min' => 0,
                    'notice' => null,
                ]);
        }
    }
}
