greet = "Привет, {user_name}! Ваш ID: {user_id}\nВыберите из меню, что вам нужно))"
menu = "📍 Главное меню"

import_data = 'Вы выбрали "Выгрузка данных на сайт"\nКакие данные хотите выгружать на сайт?'
search_data = 'Вы выбрали "Обновление индексов поиска"\nЧто Вам необходимо нужно, выбирите в меню/'

data_handler = "Запущен процесс: {output_text}"
data_handler_from_user = "Пользователь: {user_name}\n{import_data_handler}"

text_wait = "⏳Пожалуйста, подождите немного, ваш запрос обрабатывается..."
text_exit = "Чтобы выйти из диалога, нажмите на кнопку ниже"
