@extends('layouts.default')

@section('banner', '')

@section('content')
    <h3 class="text-center">Развитие сети/Аренда</h3>

    <div class="page">
        <p>Мы заинтересованы в активном развитии нашей сети. Просим Вас внимательно ознакомиться с требованиями, предъявляемыми нами к потенциальным помещениям.</p>
        <p>Если ваше предложение отвечает нашим требованиям, просим Вас прислать его по указанному адресу. После проведения экспертизы предложения и последующей заинтересованности, мы обязательно свяжемся с Вами.</p>
        <p>Регион расположения: Дагестан</p>
        <p>Право пользования: Собственность / Аренда / Субаренда</p>
        <p>Площадь: от 60 – 200 кв.м.</p>

        <p class="text-center fw-bold">Местонахождение:</p>
        <ul>
            <li>Обязательна высокая интенсивность потока потенциальных посетителей.</li>
            <li>Наличие вблизи оживленных транспортных магистралей.</li>
            <li>Наличие остановок общественного транспорта.</li>
            <li>Наличие автостоянки или возможности парковки.</li>
            <li>Наличие вблизи предприятий, крупных торговых центров и бытового обслуживания.</li>
            <li>Наличие вблизи лечебных учреждений.</li>
        </ul>

        <p class="text-center fw-bold">Состояние объекта:</p>
        <ul>
            <li>Наличие в помещении отдельного входа.</li>
            <li>Наличие водоснабжения и возможности устройства санузла.</li>
            <li>Наличие витринного пространства.</li>
            <li>Возможность размещения полноценной рекламной вывески и консоли «крест», согласно утвержденной концепции оформления фасада.</li>
        </ul>

        <h5 class="text-center fw-bold">Ждем Ваших предложений</h5>
        <p>Просим Вас заполнить форму с характеристиками предлагаемого Вами помещения или написать нам на адрес <a href="mailto:liion83@mail.ru">liion83@mail.ru</a></p>
    </div>
@endsection
